RT-Thread/rt-thread/bsp/cy8c6347bzi-cy-062/CY8C6347BZI/Test.cydsn/Generated_Source/PSoC6/pdl/drivers/peripheral/sysclk/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_IloEnable
****************************************************************************//**
*
* Enables the ILO.
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*
* \funcusage
* \snippet sysclk/1.20/snippet/main.c snippet_Cy_SysClk_IloEnable
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_IloEnable(void)
{
    SRSS_CLK_ILO_CONFIG |= SRSS_CLK_ILO_CONFIG_ENABLE_Msk;
}

/*******************************************************************************
* Function Name: Cy_SysClk_IloDisable
****************************************************************************//**
*
* Disables the ILO. ILO can't be disabled if WDT is enabled.
*
* \return Error / status code:<br>
* CY_SYSCLK_SUCCESS - ILO successfully disabled<br>
* CY_SYSCLK_INVALID_STATE - Cannot disable the ILO if the WDT is enabled.
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
* Do not call this function if the WDT is enabled, because the WDT is clocked by
* the ILO.
*
* \funcusage
* \snippet sysclk/1.20/snippet/main.c snippet_Cy_SysClk_IloDisable
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_status_t Cy_SysClk_IloDisable(void)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;
    if (!_FLD2BOOL(SRSS_WDT_CTL_WDT_EN, SRSS_WDT_CTL)) /* if disabled */
    {
        SRSS_CLK_ILO_CONFIG &= ~SRSS_CLK_ILO_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_SUCCESS;
    }
    return retVal;
}

/*******************************************************************************
* Function Name: Cy_SysClk_IloHibernateOn
****************************************************************************//**
*
* Controls whether the ILO stays on during a hibernate, or through an XRES or
* brown-out detect (BOD) event.
*
* \param on
* true = ILO stays on during hibernate or across XRES/BOD.<br> 
* false = ILO turns off for hibernate or XRES/BOD.
*
* \note Writes to the register/bit are ignored if the watchdog (WDT) is locked.
*
* \funcusage
* \snippet sysclk/1.20/snippet/main.c snippet_Cy_SysClk_IloHibernateOn
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_IloHibernateOn(bool on)
{
    CY_REG32_CLR_SET(SRSS_CLK_ILO_CONFIG, SRSS_CLK_ILO_CONFIG_ILO_BACKUP, (uint32_t)on);
}
/** \} group_sysclk_ilo_funcs */


/* ========================================================================== */
/* ===========================    PILO SECTION    =========================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_pilo_funcs
* \{
*/
__STATIC_INLINE void Cy_SysClk_PiloEnable(void);
__STATIC_INLINE void Cy_SysClk_PiloDisable(void);
__STATIC_INLINE void Cy_SysClk_PiloSetTrim(uint32_t trimVal);
__STATIC_INLINE uint32_t Cy_SysClk_PiloGetTrim(void);

/*******************************************************************************
* Function Name: Cy_SysClk_PiloEnable
****************************************************************************//**
*
* Enables the PILO. 
*
* \note This function blocks for 1 millisecond between enabling the PILO and 
* releasing the PILO reset.
*
* \funcusage
* \snippet sysclk/1.20/snippet/main.c snippet_Cy_SysClk_PiloEnable
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PiloEnable(void)
{
    SRSS_CLK_PILO_CONFIG |= _VAL2FLD(SRSS_CLK_PILO_CONFIG_PILO_EN, 1U); /* 1 = enable */
    Cy_SysLib_Delay(1U/*msec*/);
    /* release the reset and enable clock output */
    SRSS_CLK_PILO_CONFIG |= SRSS_CLK_PILO_CONFIG_PILO_RESET_N_Msk |
                            SRSS_CLK_PILO_CONFIG_PILO_CLK_EN_Msk;
}

/*******************************************************************************
* Function Name: Cy_SysClk_PiloDisable
****************************************************************************//**
*
* Disables the PILO.
*
* \funcusage
* \snippet sysclk/1.20/snippet/main.c snippet_Cy_SysClk_PiloDisable
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PiloDisable(void)
{
    /* Clear PILO_EN, PILO_RESET_N, and PILO_CLK_EN bitfields. This disables the
       PILO and holds the PILO in a reset state. */
    SRSS_CLK_PILO_CONFIG &= (uint32_t)~(SRSS_CLK_PILO_CONFIG_PILO_EN_Msk      |
                                        SRSS_CLK_PILO_CONFIG_PILO_RESET_N_Msk |
                                        SRSS_CLK_PILO_CONFIG_PILO_CLK_EN_Msk);
}

/*******************************************************************************
* Function Name: Cy_SysClk_PiloSetTrim
****************************************************************************//**
*
* Sets the PILO trim bits, which adjusts the PILO frequency. This is typically
* done after measuring the PILO frequency; see \ref Cy_SysClk_StartClkMeasurementCounters().
*
* \funcusage
* \snippet sysclk/1.20/snippet/main.c snippet_Cy_SysClk_PiloSetTrim
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PiloSetTrim(uint32_t trimVal)
{
    CY_REG32_CLR_SET(SRSS_CLK_PILO_CONFIG, SRSS_CLK_PILO_CONFIG_PILO_FFREQ, trimVal);
}

/*******************************************************************************
* Function Name: Cy_SysClk_PiloGetTrim
****************************************************************************//**
*
* Reports the current PILO trim bits value.
*
* \funcusage
* Refer to the Cy_SysClk_PiloSetTrim() function usage.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_PiloGetTrim(void)
{
    return (_FLD2VAL(SRSS_CLK_PILO_CONFIG_PILO_FFREQ, SRSS_CLK_PILO_CONFIG));
}
/** \} group_sysclk_pilo_funcs */


/* ========================================================================== */
/* ====================    CLOCK MEASUREMENT SECTION    ===================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_calclk_enums
* \{
*/
/** Defines all possible clock sources. */
typedef enum
{
    CY_SYSCLK_MEAS_CLK_NC =            0U,
    CY_SYSCLK_MEAS_CLK_ILO =           1U,
    CY_SYSCLK_MEAS_CLK_WCO =           2U,
    CY_SYSCLK_MEAS_CLK_BAK =           3U,
    CY_SYSCLK_MEAS_CLK_ALTLF =         4U,
    CY_SYSCLK_MEAS_CLK_LFCLK =         5U,
    CY_SYSCLK_MEAS_CLK_IMO =           6U,
    CY_SYSCLK_MEAS_CLK_PILO =          8U,
    CY_SYSCLK_MEAS_CLK_FAST_CLKS =     0x100U,
    CY_SYSCLK_MEAS_CLK_ECO =           0x101U,
    CY_SYSCLK_MEAS_CLK_EXT =           0x102U,
    CY_SYSCLK_MEAS_CLK_ALTHF =         0x103U,
    CY_SYSCLK_MEAS_CLK_TIMERCLK =      0x104U,
    CY_SYSCLK_MEAS_CLK_PATH_CLKS =     0x500U,
    CY_SYSCLK_MEAS_CLK_PATH0 =         0x500U,
    CY_SYSCLK_MEAS_CLK_PATH1 =         0x501U,
    CY_SYSCLK_MEAS_CLK_PATH2 =         0x502U,
    CY_SYSCLK_MEAS_CLK_PATH3 =         0x503U,
    CY_SYSCLK_MEAS_CLK_PATH4 =         0x504U,
    CY_SYSCLK_MEAS_CLK_PATH5 =         0x505U,
    CY_SYSCLK_MEAS_CLK_PATH6 =         0x506U,
    CY_SYSCLK_MEAS_CLK_PATH7 =         0x507U,
    CY_SYSCLK_MEAS_CLK_PATH8 =         0x508U,
    CY_SYSCLK_MEAS_CLK_PATH9 =         0x509U,
    CY_SYSCLK_MEAS_CLK_PATH10 =        0x50AU,
    CY_SYSCLK_MEAS_CLK_PATH11 =        0x50BU,
    CY_SYSCLK_MEAS_CLK_PATH12 =        0x50CU,
    CY_SYSCLK_MEAS_CLK_PATH13 =        0x50DU,
    CY_SYSCLK_MEAS_CLK_PATH14 =        0x50EU,
    CY_SYSCLK_MEAS_CLK_PATH15 =        0x50FU,
    CY_SYSCLK_MEAS_CLK_CLKHFS =        0x600U,
    CY_SYSCLK_MEAS_CLK_CLKHF0 =        0x600U,
    CY_SYSCLK_MEAS_CLK_CLKHF1 =        0x601U,
    CY_SYSCLK_MEAS_CLK_CLKHF2 =        0x602U,
    CY_SYSCLK_MEAS_CLK_CLKHF3 =        0x603U,
    CY_SYSCLK_MEAS_CLK_CLKHF4 =        0x604U,
    CY_SYSCLK_MEAS_CLK_CLKHF5 =        0x605U,
    CY_SYSCLK_MEAS_CLK_CLKHF6 =        0x606U,
    CY_SYSCLK_MEAS_CLK_CLKHF7 =        0x607U,
    CY_SYSCLK_MEAS_CLK_CLKHF8 =        0x608U,
    CY_SYSCLK_MEAS_CLK_CLKHF9 =        0x609U,
    CY_SYSCLK_MEAS_CLK_CLKHF10 =       0x60AU,
    CY_SYSCLK_MEAS_CLK_CLKHF11 =       0x60BU,
    CY_SYSCLK_MEAS_CLK_CLKHF12 =       0x60CU,
    CY_SYSCLK_MEAS_CLK_CLKHF13 =       0x60DU,
    CY_SYSCLK_MEAS_CLK_CLKHF14 =       0x60EU,
    CY_SYSCLK_MEAS_CLK_CLKHF15 =       0x60FU,
    CY_SYSCLK_MEAS_CLK_LAST_CLK =      0x610U
} cy_en_meas_clks_t;
/** \} group_sysclk_calclk_enums */

/**
* \addtogroup group_sysclk_calclk_funcs
* \{
*/
cy_en_sysclk_status_t Cy_SysClk_StartClkMeasurementCounters(cy_en_meas_clks_t clock1, uint32_t count1, cy_en_meas_clks_t clock2);
__STATIC_INLINE bool Cy_SysClk_ClkMeasurementCountersDone(void);
uint32_t Cy_SysClk_ClkMeasurementCountersGetFreq(bool measuredClock, uint32_t refClkFreq);

